public class Task16 implements Runnable {
    @Override
    public void run() {
//Q # 16) Напишите Java-программу, чтобы найти второе по величине число в массиве.
//        Ответ:
//        В этой программе мы инициализировали массив с 10 случайными элементами, из которых мы собираемся найти второе по величине число. Далее мы создали две целочисленные переменные, которым будем присваивать значения двух целых чисел из массива - самого большого и второго по величине. Обе переменные изначально получают значения первого по индексу элемента массива. Затем мы выводим на экран все элементы, используя цикл for.
//        Дальнейшая логика работы программы в том, чтобы используя цикл for обойти массив.
//        При обходе, если элемент массива с текущим индексом больше, чем значение, хранящееся в переменной biggest, тогда переменной secondBiggest присваиваем значение, хранящееся в biggest, а переменной biggest – новое наибольшее значение в соответствии со значением текущего элемента массива. Опять же, если элемент по текущему индексу больше, чем secondBiggest, то присвойте secondBiggest значение этого элемента.
//        Это будет повторяться для каждой итерации и, в конечном итоге, после завершения обхода массива в цикле вы получите элементы наибольший и второй по величине элементы массива в переменных biggest и secondBiggest соответственно.


        // ITVDN.com 16 из ТОП 20 тестовых заданий на интервью для Java разработчика


        int numbersArray[] = {10, 15, 32, 100, 16, 11, 98, 36, 95, 33};

        int biggest = numbersArray[0];

        int secondBiggest = numbersArray[0];

        System.out.println("Полученный массив: ");

        for (int i = 0; i < numbersArray.length; i++) {

            System.out.print(numbersArray[i] + "\t");

        }

        for (int i = 0; i < numbersArray.length; i++) {

            if (numbersArray[i] > biggest) {

                secondBiggest = biggest;

                biggest = numbersArray[i];

            } else if (numbersArray[i] > secondBiggest && numbersArray[i] != biggest) {

                secondBiggest = numbersArray[i];

            }

        }

        System.out.println("\nВторое по величине число:" + secondBiggest);

    }

}